emacslib/dotemacsw.org
** @ac

#+BEGIN_SRC emacs-lisp
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; auto-complete, [2014-11-06]
(add-to-list 'load-path (concat path-to "auto-complete-master/"))
; (add-to-list 'load-path (concat path-to "auto-complete-master"))
; (add-to-list 'ac-dictionary-directories "D:/dotemacsw/auto-complete-master/ac-dict")
(require 'auto-complete)
(require 'auto-complete-config)
(ac-config-default)
(add-to-list 'ac-dictionary-directories (concat path-to "auto-complete-master/ac-dict"))
(auto-complete-mode 1) 

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
#+END_SRC
*** @ac, ac-ispell
#+BEGIN_SRC emacs-lisp
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; @win
  (if (string-equal system-type "windows-nt")
  (and (progn (add-to-list 'exec-path "C:/Program Files (x86)/Aspell/bin"))
  (setq-default ispell-program-name "aspell")
  (progn (setq ispell-personal-dictionary "C:/Program Files (x86)/Aspell/dict"))))
  
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; @mac, [2015-12-28]
  (if (string-equal system-type "darwin")
  (and (setq ispell-program-name "/usr/local/bin/ispell")
  (setq-default ispell-program-name "/usr/local/bin/aspell")))
  
  ; @seamless, for both 
  (require 'ispell)
  (setq text-mode-hook '(lambda()  (flyspell-mode t)  ) )
  (add-hook 'LaTeX-mode-hook 'flyspell-mode)
  (ispell-minor-mode) 
  
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
#+END_SRC
*** @ac, first ispell, then ac-ispell [2015-12-28]
#+BEGIN_SRC emacs-lisp
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(add-to-list 'load-path (concat path-to "auto-complete-master/"))
; (add-to-list 'load-path "D:/dotemacsw/auto-complete-master/")
(require 'ac-ispell)
(eval-after-load "auto-complete" '(progn (ac-ispell-setup)))
(add-hook 'git-commit-mode-hook 'ac-ispell-ac-setup)
(add-hook 'mail-mode-hook 'ac-ispell-ac-setup)

; error enabling flyspell mode, ispell-set-spellcheker, /141106
(setq flyspell-issue-welcome-flag nil)
;; fix flyspell problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
#+END_SRC
** @auctex, no use [2015-12-24]
#+BEGIN_SRC emacs-lisp
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; Ctex: C:\CTEX\MiKTeX\miktex\bin
;(setq path "C:\CTEX\MiKTeX\miktex\bin:")
;(setenv "PATH" path)
 
;; Auctex, /[2014-10-23]
;; (add-to-list 'load-path (concat path-to "site-lisp/site-start.d"))
;; (add-to-list 'load-path (concat path-to "site-lisp/site-start.d"))  ; very important, /20141023
;; (load "auctex.el" nil t t)
;; (load "preview-latex.el" nil t t)
;; (setq TeX-auto-save t)
;; (setq TeX-parse-self t)
;; (setq-default TeX-master nil)
;; (setq preview-scale-function 1.3)
;; (setq LaTeX-math-menu-unicode t)
;; (setq TeX-insert-braces nil)
;; (add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
;; ;; RefTeX with AUCTeX
;; ;; reftex, /141023
;; (setq reftex-plug-into-auctex t)
;; (add-hook 'latex-mode-hook 'turn-on-reftex) 
;; (setq reftex-cite-format 'natbib) 
 ; cite-style, /141023


;; "XeLaTeX", xetex, / [2014-11-03]
;(setq TeX-PDF-mode t) ; annual, c-c,c-t, c -p, /140318
;; (add-hook 'LaTeX-mode-hook (lambda()
;;                               (add-to-list 'TeX-command-list '("XeLaTeX" "%`xelatex%(mode)%' %t" TeX-run-TeX nil t))
;;                               (setq TeX-command-default "XeLaTeX")
;;                                  (setq TeX-save-query  nil )
;;                                   (setq TeX-show-compilation t) 
;;                                                                ))
;; (setq tex-engine 'xetex)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
#+END_SRC

** @auto-save, [2014-11-21]

#+BEGIN_SRC emacs-lisp
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(setq auto-save-default t)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
#+END_SRC

** @mew, no use
#+BEGIN_SRC emacs-lisp
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; @mew, email, @success, work [2015-12-21]
    ;; load Mew, [2014-11-07]
    ;; (add-to-list 'load-path (concat path-to "mew-lisp"))
    ;; (autoload 'mew "mew" nil t)
    ;; (autoload 'mew-send "mew" nil t)
    ;; (setq mew-icon-directory (concat path-to "mew-lisp/etc"))
    ;; (setq mew-use-cached-passwd t)
    ;; (if (boundp 'read-mail-command)
    ;; (setq read-mail-command 'mew))
    ;; (autoload 'mew-user-agent-compose "mew" nil t)
    ;; (if (boundp 'mail-user-agent)
    ;; (setq mail-user-agent 'mew-user-agent))
    ;; (if (fboundp 'define-mail-user-agent)
    ;; (define-mail-user-agent
    ;; 'mew-user-agent
    ;; 'mew-user-agent-compose
    ;; 'mew-draft-send-message
    ;; 'mew-draft-kill
    ;; 'mew-send-hook))
    ;; (setq mew-pop-size 0)
    ;; (setq mew-smtp-auth-list nil)
    ;; (setq toolbar-mail-reader 'Mew)
    ;; (set-default 'mew-decode-quoted 't)
    ;; (when (boundp 'utf-translate-cjk)
    ;; (setq utf-translate-cjk t)
    ;; (custom-set-variables
    ;; '(utf-translate-cjk t)))
    ;; (if (fboundp 'utf-translate-cjk-mode)
    ;; (utf-translate-cjk-mode 1))
    ;; (setq mew-config-alist '(
    ;; ("default"
    ;; ("name" . "xiaoanhuang")
    ;; ("user" . "xiaoanhuang")
    ;; ("smtp-server" . "smtp.163.com")
    ;; ("smtp-port" . "25")
    ;; ("pop-server" . "pop3.163.com")
    ;; ("pop-port" . "110")
    ;; ("smtp-user" . "xiaoanhuang")
    ;; ("pop-user" . "xiaoanhuang")
    ;; ("mail-domain" . "163.com")
    ;; ("mailbox-type" . pop)
    ;; ("pop-auth" . pass)
    ;; ("smtp-auth-list" . ("PLAIN" "LOGIN" "CRAM-MD5"))
    ;; )
    ;; ))
;     (setq mew-ssl-verify-level 0)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
#+END_SRC

** @predictive, [2014-11-04]
#+BEGIN_SRC emacs-lisp
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; predictive install location
(add-to-list 'load-path (concat path-to "predictive"))
     ;; dictionary locations
(add-to-list 'load-path (concat path-to "predictive/latex/"))
(add-to-list 'load-path (concat path-to "predictive/texinfo/"))
 (add-to-list 'load-path (concat path-to "predictive/html/"))
 (autoload 'predictive-mode (concat path-to "predictive/") "Turn on Predictive Completion Mode." t)
;    (autoload 'predictive-mode (concat path-to "predictive/" "Turn on Predictive Completion Mode." t))
     ;; load predictive package
;     (require 'predictive)
;(autoload 'predictive-mode "D:/Emacs14/predictive/predictive" "Turn on Predictive Completion Mode." t)
; delete predictive, /141110
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
#+END_SRC


** @session, [2015-12-28]
#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path path-to)
  (require 'session)
#+END_SRC

