emacslib/dotemacsw.org
** @org all left is org

#+BEGIN_SRC emacs-lisp
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ; *** @org-mobile, [2014-12-16]
  ; comment org-mobile-files [2015-12-28]
  ; (setq org-mobile-files (quote ( (concat git-to "HXA.OFDM.PON.org")  (concat git-to "journal.org")  (concat git-to "project.org")  (concat git-to "task.org")  (concat git-to "note.org") )))
  ; (setq org-mobile-index-file "D:/GTD18/inbox.org")
  ; (setq org-mobile-index-file "inbox.org")
  ; (setq org-mobile-inbox-for-pull "D:/GTD18/fromMobile.org")
  ; (setq org-mobile-inbox-for-pull "D:/GTD18/inbox.org")
  
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ; *** @org-capture, / [2014-11-27]
  (setq org-capture-templates '(
  ("t" "Task" entry (file+headline (concat git-to "task.org") "Tasks") "* TODO %?\n %i\n %a")
  ("j" "Journal" entry (file+datetree (concat git-to "journal.org")) "* %?\nEntered on %U\n %i\n %a")
  ("n" "Note" entry (file+datetree (concat git-to "note.org") ) "* %?\nEntered on %U\n %i\n %a")
  ("p" "Project" entry (file+datetree (concat git-to "project.org") ) "* %?\nEntered on %U\n %i\n %a")
  ))
  ; M-x org-capture-import-remember-templates RET
  
  ; (define-key global-map "\C-cc" ’org-capture)
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ; *** @org-remember, [2014-11-19]
  (define-key global-map "\C-cr" 'org-remember)
  
  ; (org-remember-insinuate)
  ; must add remember-mode-hook, /141119
    (setq remember-annotation-functions '(org-remember-annotation))
    (setq remember-handler-functions '(org-remember-handler))
    (add-hook 'remember-mode-hook 'org-remember-apply-template)
  
  ; (setq org-directory (concat git-to "/") 
  (setq org-remember-templates '(("New" ?n "* %? %t \n %i\n %a" (concat git-to "inbox.org") ) ("Task" ?t "** TODO %?\n %i\n %a" (concat git-to "task.org") "Tasks") ("Calendar" ?c "** TODO %?\n %i\n %a" (concat git-to "task.org") "Tasks") ("Idea" ?i "** %?\n %i\n %a" (concat git-to "task.org") "Ideas") ("Note" ?r "* %?\n %i\n %a" (concat git-to "note.org") ) ("Project" ?p "** %?\n %i\n %a" (concat git-to "project.org") %g)  ("Journal" ?j "* %?\n %i\n %a" (concat git-to "journal.org") )  )) 
  
  ; (setq org-directory git-to) 
  ; (setq org-directory "D:/GTD18/") 
  (setq org-default-notes-file (concat git-to "inbox.org"))  ; [2015-12-30]
  ; (setq org-default-notes-file (concat org-directory "inbox.org"))
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ; *** @org-todo, [2014-11-19]
  (setq org-todo-keywords
    '((type "Work(w!)" "Huang(h!)" "|")
  ;    (type "Work(w!)" "Huang(h!)" "Study(s!)" "|")
      (sequence "PENDING(p!)" "TODO(t!)"  "|" "DONE(d!)" "ABORT(a@/!)")
  ))
  (setq org-todo-keyword-faces
    '(("Work" .      (:background "red" :foreground "white" :weight bold))
  ;    ("Study" .      (:background "white" :foreground "red" :weight bold))
  ; <x-bg-color>, background can not be White, <2014-12-23>
  ;    ("Study" .      (:background "gray" :foreground "red" :weight bold))
  ;    ("Fun" .      (:foreground "MediumBlue" :weight bold)) 
      
      ("Huang" .      (:background "red" :foreground "orange" :weight bold)) 
      ("PENDING" .   (:background "LightGreen" :foreground "gray" :weight bold))
      ("TODO" .      (:background "DarkOrange" :foreground "black" :weight bold))
      ("DONE" .      (:background "azure" :foreground "Darkgreen" :weight bold)) 
      ("ABORT" .     (:background "gray" :foreground "black"))
  ))
  
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ; *** @org-setting, [2014-11-19]
  (setq org-tag-alist '(("@Fit" . ?f) ("@huang" . ?h) ("@home" . ?m) ("@Lang" . ?l) ("@Basic" . ?b) ("@Emacs" . ?e) ("@paper" . ?p) ("@work" . ?w)   ("@DOCSIS" . ?d) ("@Meeting" . ?M) ("@Famous" .?F)))
  
  ;; priority setting, [2014-11-19] 
  ; lowest can not be D, must E, /141119
  (setq org-highest-priority ?A)
  (setq org-lowest-priority  ?E)
  (setq org-default-priority ?E)
  
  ;; org face 
  (setq org-priority-faces
    '((?A . (:background "red" :foreground "white" :weight bold))
      (?B . (:background "DarkOrange" :foreground "white" :weight bold))
      (?C . (:background "yellow" :foreground "DarkGreen" :weight bold))
      (?D . (:background "DodgerBlue" :foreground "black" :weight bold))
      (?E . (:background "SkyBlue" :foreground "black" :weight bold))
  ))
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; ** DONE @bib
  ; http://blog.waterlin.org/articles/bind-emacs-org-mode-with-bibtex.html
  ; (concat path-to "bib1307.bib")
  (setq reftex-default-bibliography
        (list
         (concat path-to "bib1307.bib")  (concat path-to "bib1410.bib")   (concat path-to"bib1506.bib")  (concat path-to"bib1505.bib")  )) ; @success, list [2015-12-30]
  
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;   
  ;; *** @bib: @auto: @org-mode-reftex-setup, "C-c (",  RefTeX, [2015-12-30]
  ; @key, @redo, first setq org-link-abbrev-alist [2015-12-30]
  ; @key: missing ), @org-mode-reftex-setup, [2015-12-30]
  
  ; (concat git-to "notes.org")
  ; D:/gitlib/orglib/emacslib
  ;;  org-mode reftex, [2015-01-27]
  ;; @ln: https://wiki.freebsdchina.org/doc/r/reference
  ;; define org-mode-reftex-search
  
  (defun org-mode-reftex-search ()
   ;; jump to the notes for the paper pointed to at from reftex search
   (interactive)
   (org-open-link-from-string (format "[[notes:%s]]" (reftex-citation t))))
  
  ; @org-link, [2015-12-30]
  ; replace D: to /Volumes/xiaoanh
  (cond 
  ((string-equal system-type "darwin")
  (setq org-link-abbrev-alist
   '(("bib" . "/Volumes/xiaoanh/gitlib/orglib/emacslib/bib1410.bib::%s, /Volumes/xiaoanh/gitlib/orglib/emacslib/bib1505.bib::%s, /Volumes/xiaoanh/gitlib/orglib/emacslib/bib1506.bib::%s")
     ("notes" .  "/Volumes/xiaoanh/gitlib/orglib/emacslib/bib_notes.org::%s")
     ("figs" . "/Volumes/xiaoanh/figure1411/%s.png")
  ;   ("papers" . "D:/bib1410/paper1410/%s.pdf")
     ("papers" . "/Volumes/xiaoanh/bitlib/orglib/paper1512/%s.pdf"))))
  ((string-equal system-type "windows-nt")
  (setq org-link-abbrev-alist
   '(("bib" . "D:/gitlib/orglib/emacslib/bib1410.bib::%s, D:/gitlib/orglib/emacslib/bib1505.bib::%s, D:/gitlib/orglib/emacslib/bib1506.bib::%s")
     ("notes" .  "D:/gitlib/orglib/emacslib/bib_notes.org::%s")
  ;   ("notes" . "(concat git-to "notes.org") ::%s")
  ;  (invalid-read-syntax ". in wrong context")
  ;    ("notes" . (concat git-to "notes.org::%s")
     ("figs" . "D:/figure1411/%s.png")
  ;   ("papers" . "D:/bib1410/paper1410/%s.pdf")
     ("papers" . "D:/bitlib/orglib/paper1512/%s.pdf")))))
  
  (defun org-mode-reftex-setup ()
    (load-library "reftex")
    (and (buffer-file-name) (file-exists-p (buffer-file-name))
         (progn
      ;; enable auto-revert-mode to update reftex when bibtex file changes on disk
      (global-auto-revert-mode t)
      (reftex-parse-all)
      ;; add a custom reftex cite format to insert links
      (reftex-set-cite-format
        '((?b . "[[bib:%l][%l-bib]]")
          (?c . "\\cite{%l}")
          (?n . "[[notes:%l][%l-notes]]")
          (?p . "[[papers:%l][%l-paper]]")
          (?t . "%t")
          (?h . "** %t\n:PROPERTIES:\n:Custom_ID: %l\n:END:\n[[papers:%l][%l-paper]]"))))))
  
  (define-key org-mode-map (kbd "C-c )") 'reftex-citation) ; @success, list [2015-12-30]
    ;; binding of  ”C-c (” to org-mode-reftex-search
  (define-key org-mode-map (kbd "C-c (") 'org-mode-reftex-search)
  (add-hook 'org-mode-hook 'org-mode-reftex-setup)
  
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ; *** Epresent [2014-12-10]
  ; Debugger entered--Lisp error: (file-error "Cannot open load file" "ox")  require(ox)
  ; (add-to-list 'load-path (concat path-to "epresent-master"))
  ; (require 'epresent)
  ; epresent and reveal fail, due to ox missing and latest org-mode 8.0, [2015-07-07]
  
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ; *** @ditaa, [2015-07-02]
  ; (setq org-ditaa-jar-path “~/.emacs.d/plugins/ditaa/ditaa0_9.jar”) 
  ;(setq org-plantuml-jar-path “~/java/plantuml.jar”)
  ; (add-hook ‘org-babel-after-execute-hook ‘org-display-inline-images ‘append)
  ; (org-babel-do-load-languages 'org-babel-load-languages '((ditaa . t))) 
  ; this line activates ditaa
  ; can not find ditaa.jar can be found in contrib/scripts
  ; C:\Users\xiaoanh\Downloads\Emacs24.3\lisp
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;   
#+END_SRC

