emacslib/dotemacsw.org
* @debug [2015-12-28]
** TODO open pdf in helm-bibtex
*** helm-bibtex-pdf-open-function
#+BEGIN_SRC emacs-lisp
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ; https://github.com/tmalsburg/helm-bibtex
    ; @mac, helm-bibtex-pdf-open-function
    ; m-x getenv | setenv | eval-expression 
    ; (defun helm-open-file-with-default-tool) in helm-utils.el
    (cond 
    ((string-equal system-type "darwin") ; @mac
    (setq helm-bibtex-pdf-open-function
      (lambda (fpath)
        (start-process "skim" "*skim*" "open" (concat "-a /Applications/Skim.app " fpath))))))
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ; https://github.com/tmalsburg/helm-bibtex
    ; @win
    ; emacs  AcroRd32.exe
    ; permission denied open
    ; C:\Program Files (x86)\Adobe\Acrobat Reader DC\Reader\AcroRd32.exe 
  ;;   (setq local-pdf-viewer
  ;;         (cond
  ;;          ((eq 'windows-nt system-type)
  ;;           "/c/Program\\ Files\\ \\(x86\\)/Adobe/Acrobat \\ Reader \\ DC /Reader/AcroRd32.exe")
  ;; ;          "/cygdrive/c/Program\\ Files\\ \\(x86\\)/Adobe/Reader\\ 10.0/Reader/AcroRd32.exe")
  ;;          ((eq 'gnu/linux system-type) "okular")
  ;;          ((eq 'darwin system-type) "open")))
    
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
#+END_SRC

*** Permission denied (open)
*** exec-path
    1. (add-to-list 'exec-path "C:/Program Files (x86)/Adobe/Acrobat Reader DC/Reader/")
*** setq local-pdf-viewer
    1. not work
*** @success, aspell
(if (string-equal system-type "windows-nt")
(setq-default ispell-program-name "aspell"))

** DONE @anything, @helm [2015-12-29]
   CLOSED: [2015-12-30 Wed 09:50]
   - State "DONE"       from "TODO"       [2015-12-30 Wed 09:50]

*** [#C] @key, @helm can work in @win, just copy from @mac 
    1. @success, run make @mac, then upload to github, download to @win, then work
    2. can not load anything-config, [2015-12-30]
    3. can not load helm-autoloads, @win

** TODO @helm-bibtex
*** @ac, first ispell, then ac-ispell [2015-12-28]
*** @ac, @lisp: and ;; @mac, [2015-12-28]
(if (string-equal system-type "darwin")
(and (setq ispell-program-name "/usr/local/bin/ispell") (setq-default ispell-program-name "/usr/local/bin/aspell")))
*** (setq helm-bibtex-bibliography (list (concat path-to "bib1410.bib") (concat path-to "bib1505.bib") (concat path-to "bib1506.bib") ))
;    (setq helm-bibtex-bibliography '( (concat path-to "bib1410.bib") (concat path-to "bib1505.bib") (concat path-to "bib1506.bib") ))
*** can't find dash, dash should be first before s [2015-12-28]
*** bib1410->gitlib/orglib [2015-12-28]
    1. ; helm-bibtex, bitlib->gitlib [2015-12-28]
    2. bitlib->gitlib
    3. (setq helm-bibtex-library-path "D:/bitlib/orglib/paper1512/" )
** @org
*** TODO (setq org-link-abbrev-alist
    1. concat
*** [#C] quote to list '(org-agenda-files (list (concat git-to "paper.org") [2015-12-28]
    1. '(org-agenda-files (list (concat git-to "paper.org") (concat git-to "study.org") (concat git-to "journal.org") (concat git-to "project.org") (concat git-to "task.org") (concat git-to  "note.org")))
    2. '(org-agenda-files (quote (concat git-to, is wrong

*** DONE setq org-remember-templates
*** DONE setq org-capture-templates 
*** concat git-to "task.org" [2015-12-28]
*** @comment org-mobile-files [2015-12-28]
    1. (setq org-mobile-files (quote ( (concat git-to "HXA.OFDM.PON.org")  (concat git-to "journal.org")  (concat git-to "project.org")  (concat git-to "task.org")  (concat git-to "note.org") )))
** @other
*** (number-or-marker-p OBJECT) 
    1. Return t if OBJECT is a number or a marker.
*** add @session [2015-12-28]
    1. http://emacs-session.sourceforge.net
    2. load session error
*** DONE custom-set-variables
    1. org-agenda-files

* @study: @dotemacs
** TODO eldoc
   - State "TODO"       from ""           [2015-12-30 Wed 09:59]
*** org-eldoc
    1. https://bitbucket.org/ukaszg/org-eldoc
** @ln, [2015-12-29]
*** @sachac: http://sachac.com/
*** @sachac: https://github.com/sachac/, http://sachachua.com/blog/

** @eng, [2015-12-29]
   1. predicate | indicate, lexical-word | tweak-twist
   2. pimp: a man who controls prostitutes
   3. performance-oriented
   4. with no loss of functionality
   5. defer | diminish | backend
   6. goldmine
** org-babel-load-file, @study: #time-less-p, nth and file-attributes#  [2015-12-29]

#+BEGIN_SRC emacs-lisp
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ; @ln: http://endlessparentheses.com/init-org-Without-org-mode.html
  ; nth, file-attributes, time-less-p
  ; number-or-marker-p nil
  ; p is predicate, | indicate

  ; DEFVAR and DEFPARAMETER introduce global dynamic variables. 
  ;; (setq user-emacs-directory path-to)
  ;; ; (defvar user-emacs-directory path-to)
  ;; (expand-file-name "dotemacsw.org" user-emacs-directory)
  ;; (expand-file-name "dotemacsw.el" path-to)
  ;; (nth 5 (file-attributes init-source-org-file))
  ;; (nth 5 (file-attributes init-source-el-file))
  ;; (time-less-p (nth 5 (file-attributes init-source-org-file)) (nth 5 (file-attributes init-source-el-file)))
  ;; (fboundp 'org-babel-load-file)    
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
#+END_SRC
*** org-babel-load-file, time-less-p,  [2015-12-29]
#+BEGIN_SRC emacs-lisp  
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; (defvar init-source-org-file (expand-file-name "dotemacsw.org" path-to)
    ;;   "The file that our emacs initialization comes form") 
    ;; (defvar init-source-el-file (expand-file-name "dotemacsw.el" path-to)
    ;;   "The file that our emacs initialization is generated into")
    
    ;; (if (file-exists-p init-source-org-file)
    ;;   (if (and (file-exists-p init-source-el-file)
    ;;            (time-less-p (nth 5 (file-attributes init-source-org-file)) (nth 5 (file-attributes init-source-el-file))))
    ;;       (load-file init-source-el-file)
    ;;     (if (fboundp 'org-babel-load-file) 
    ;; ; ' disqus syntax highlighting is lame
    ;;         (org-babel-load-file init-source-org-file)
    ;;       (message "Function not found: org-babel-load-file")
    ;;       (load-file init-source-el-file)))
    ;;   (error "Init org file '%s' missing." init-source-org-file))
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;  
#+END_SRC

* @lisp, from eintr.pdf
** @basic
   1. - 用作“割断”字符用来分隔变量、函数等名称里的字（word），这是Lisp编程惯用法，类似C和Ada里的“_”
** 1 List Processing
*** 1.1 Lisp Lists
**** 1.1.1 Lisp Atoms
#+BEGIN_SRC emacs-lisp
'(this list includes "text between quotation marks.")
; => a list
’(this is a quoted list)
; => @err 
'(this is a quoted list)
(this is an unquoted list)
; => this is not fun
'(this is an unquoted list)
(+ 2 2)
; => 4
'(+ 2 2)
; => (+ 2 2)
#+END_SRC
*** 1.7 Variables
#+BEGIN_SRC emacs-lisp
fill-column
; => 70 
(fill-column)
; => @err, not a fun
(set 'flowers '(rose violet daisy buttercup))
flowers
'flowers
(set flowers '(rose violet daisy buttercup))
(setq flowers '(rose violet daisy buttercup))
; *Backtrace* 
; eval-last-sexp.
; The command means ‘evaluate last symbolic expression’, which is the expression just before your cursor.
#+END_SRC
*** 1.8 Arguments
#+BEGIN_SRC emacs-lisp
(+ 2 fill-column)
; => 72
(concat "The " (number-to-string (+ 2 fill-column)) " red foxes.")
(+ 2 hello)
(+ 2 ’hello)
; (wrong-type-argument number-or-marker-p hello)
; The ‘p’ stands for ‘predicate’.

#+END_SRC
*** point [2015-12-31]
#+BEGIN_SRC emacs-lisp
(point-min)
(buffer-name)
(goto-char (/ (point-max) 2))
#+END_SRC

** 3 How To Write Function Definitions
*** 3.1 The defun Macro
#+BEGIN_SRC emacs-lisp
(defun multiply-by-seven (number) ; Interactive version.
"Multiply NUMBER by seven.")
#+END_SRC
*** 3.3 Make a Function Interactive, m-x
#+BEGIN_SRC emacs-lisp
  (defun multiply-by-seven (number) ; Interactive version.
  "Multiply NUMBER by seven."
  (interactive "p")
  (message "The result is %d" (* 7 number)))
  ; p: a ‘prefix’, as a number to be passed to the function.
#+END_SRC

*** 3.6 let
#+BEGIN_SRC emacs-lisp
;(let varlist body...)
(let ((birch 3)
pine
fir
(oak 'some))
(message
"Here are %d variables with %s, %s, and %s value."
birch pine fir oak))
; => "Here are 3 variables with nil, nil, and some value."
; Here, the varlist is ((birch 3) pine fir (oak ’some)).

#+END_SRC
*** 3.8 If–then–else Expressions
#+BEGIN_SRC emacs-lisp
(if (> 4 5) 
; if-part
(message "4 falsely greater than 5!") 
; then-part
(message "4 is not greater than 5!")) 
; else-part
(if nil
'true
'false)
(if 1
'right
'false)
#+END_SRC
*** 3.10 save-excursion
#+BEGIN_SRC emacs-lisp
(message "The result is %d" (* 7 5))
; => 35
(point)
(save-excursion (goto-char (point-min)) (point))
(- (point)
(save-excursion
(goto-char (point-min)) (point)))

(message "We are %d characters into this buffer."
(- (point)
(save-excursion
(goto-char (point-min)) (point))))

#+END_SRC
** 4 A Few Buffer–Related Functions
*** 4.1 Finding More Information, find-tag
    1. M-x compile RET etags *.el RET
    2. M-x compile RET etags.exe  *.el RET  ; @win
*** 4.2 A Simplified beginning-of-buffer Definition, pp62
#+BEGIN_SRC emacs-lisp
(defun simplified-beginning-of-buffer ()
"Move point to the beginning of the buffer; leave mark at previous position."
(interactive)
(push-mark)
(goto-char (point-min)))
#+END_SRC

*** 4.3 The Definition of mark-whole-buffer
#+BEGIN_SRC emacs-lisp
  (push-mark (point))
  (push-mark (point-max) nil t)
#+END_SRC

*** 4.4 The Definition of append-to-buffer in simple.el
#+BEGIN_SRC emacs-lisp
  (defun append-to-buffer (buffer start end)
    "Append to specified buffer the text of the region.
  It is inserted into that buffer before its point.
  When calling from a program, give three arguments:
  BUFFER (or buffer name), START and END.
  START and END specify the portion of the current buffer to be copied."
    (interactive
     (list (read-buffer "Append to buffer: " (other-buffer (current-buffer) t))
           (region-beginning) (region-end)))
    (let* ((oldbuf (current-buffer))
           (append-to (get-buffer-create buffer))
           (windows (get-buffer-window-list append-to t t))
           point)
      (save-excursion
        (with-current-buffer append-to
          (setq point (point))
          (barf-if-buffer-read-only)
          (insert-buffer-substring oldbuf start end)
          (dolist (window windows)
            (when (= (window-point window) point)
              (set-window-point window (point))))))))
   (other-buffer)
   (current-buffer)
   (read-buffer "read" (other-buffer))
  ; PROMP
   (other-buffer (current-buffer) t)
   (region-beginning) 
   (list (read-buffer "Append to buffer: " (other-buffer (current-buffer) t))
           (region-beginning) (region-end))
   (interactive
     (list (read-buffer "Append to buffer: " (other-buffer (current-buffer) t))
           (region-beginning) (region-end)))
#+END_SRC
** 5 A Few More Complex Functions, pp72
*** 5.4 Review
    1. &optional

** 7 car, cdr, cons: Fundamental Functions
*** 7.1 car and cdr
#+BEGIN_SRC emacs-lisp
(car '(rose violet daisy buttercup))
(cdr '(rose violet daisy buttercup))

#+END_SRC

*** 7.2 cons
#+BEGIN_SRC emacs-lisp
; The cons function constructs lists; it is the inverse of car and cdr.
(cons 'buttercup ())
; => (buttercup)
(cons 'daisy '(buttercup))
; => (daisy buttercup)
#+END_SRC

*** 7.4 nth
#+BEGIN_SRC emacs-lisp
(nth 1 '("one" "two" "three"))
#+END_SRC

** 12 Regular Expression Searches

*** 12.4 forward-paragraph: a Goldmine of Functions, let*
    1. The let* expression
#+BEGIN_SRC emacs-lisp
(let* ((foo 7)
(bar (* 3 foo)))
(message "‘bar’ is %d." bar))
; => ‘bar’ is 21
(let ((foo 7)
(bar (* 3 foo)))
(message "‘bar’ is %d." bar))
; => void foo
; make use of the values to which Emacs set variables in the earlier part of the varlist.
#+END_SRC

** 11 Loops and Recursion

