emacslib/dotemacsw.el
  ; @mac, helm-bibtex-pdf-open-function
  ; m-x getenv | setenv | eval-expression 
  ; (defun helm-open-file-with-default-tool) in helm-utils.el
  (cond 
  ((string-equal system-type "darwin") ; @mac
  (setq helm-bibtex-pdf-open-function
    (lambda (fpath)
      (start-process "skim" "*skim*" "open" (concat "-a /Applications/Skim.app " fpath))))))
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ; https://github.com/tmalsburg/helm-bibtex
  ; @win
  ; emacs  AcroRd32.exe
  ; permission denied open
  ; C:\Program Files (x86)\Adobe\Acrobat Reader DC\Reader\AcroRd32.exe 
;;   (setq local-pdf-viewer
;;         (cond
;;          ((eq 'windows-nt system-type)
;;           "/c/Program\\ Files\\ \\(x86\\)/Adobe/Acrobat \\ Reader \\ DC /Reader/AcroRd32.exe")
;; ;          "/cygdrive/c/Program\\ Files\\ \\(x86\\)/Adobe/Reader\\ 10.0/Reader/AcroRd32.exe")
;;          ((eq 'gnu/linux system-type) "okular")
;;          ((eq 'darwin system-type) "open")))
  
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ; @ln: http://endlessparentheses.com/init-org-Without-org-mode.html
  ; nth, file-attributes, time-less-p
  ; number-or-marker-p nil
  ; p is predicate, | indicate

  ; DEFVAR and DEFPARAMETER introduce global dynamic variables. 
  ;; (setq user-emacs-directory path-to)
  ;; ; (defvar user-emacs-directory path-to)
  ;; (expand-file-name "dotemacsw.org" user-emacs-directory)
  ;; (expand-file-name "dotemacsw.el" path-to)
  ;; (nth 5 (file-attributes init-source-org-file))
  ;; (nth 5 (file-attributes init-source-el-file))
  ;; (time-less-p (nth 5 (file-attributes init-source-org-file)) (nth 5 (file-attributes init-source-el-file)))
  ;; (fboundp 'org-babel-load-file)    
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; (defvar init-source-org-file (expand-file-name "dotemacsw.org" path-to)
  ;;   "The file that our emacs initialization comes form") 
  ;; (defvar init-source-el-file (expand-file-name "dotemacsw.el" path-to)
  ;;   "The file that our emacs initialization is generated into")
  
  ;; (if (file-exists-p init-source-org-file)
  ;;   (if (and (file-exists-p init-source-el-file)
  ;;            (time-less-p (nth 5 (file-attributes init-source-org-file)) (nth 5 (file-attributes init-source-el-file))))
  ;;       (load-file init-source-el-file)
  ;;     (if (fboundp 'org-babel-load-file) 
  ;; ; ' disqus syntax highlighting is lame
  ;;         (org-babel-load-file init-source-org-file)
  ;;       (message "Function not found: org-babel-load-file")
  ;;       (load-file init-source-el-file)))
  ;;   (error "Init org file '%s' missing." init-source-org-file))
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
